# Employees Data

In [49]:
import pandas as pd
import numpy as np

In [50]:
csv1 = "../Data/departments.csv"
csv2 = "../Data/dept_emp.csv"
csv3 = "../Data/dept_manager.csv"
csv4 = "../Data/employees.csv"
csv5 = "../Data/salaries.csv"
csv6 = "../Data/titles.csv"

In [51]:
# Check CSVs
data_dep = pd.read_csv(csv1)
data_dep

  dept_no           dept_name
0    d001           Marketing
1    d002             Finance
2    d003     Human Resources
3    d004          Production
4    d005         Development
5    d006  Quality Management
6    d007               Sales
7    d008            Research
8    d009    Customer Service

In [52]:
data_emp_dep = pd.read_csv(csv2)
data_emp_dep

        emp_no dept_no
0        10001    d005
1        10002    d007
2        10003    d004
3        10004    d004
4        10005    d003
...        ...     ...
331598  499995    d004
331599  499996    d004
331600  499997    d005
331601  499998    d002
331602  499999    d004

[331603 rows x 2 columns]

In [53]:
# checking if emp_no is unique   ### FALSE 
data_emp_dep["emp_no"].count() == data_emp_dep["emp_no"].nunique()

False

In [54]:
data_emp_dep["emp_no"].count()

331603

In [55]:
data_emp_dep["emp_no"].nunique()

300024

In [56]:
group_emp = data_emp_dep.groupby(by="emp_no").count()

In [57]:
group_emp=group_emp.reset_index()

In [58]:
# looking for duplicated cases
group_emp.loc[group_emp["dept_no"] > 1, :]

        emp_no  dept_no
9        10010        2
17       10018        2
28       10029        2
39       10040        2
49       10050        2
...        ...      ...
299979  499955        2
299988  499964        2
299999  499975        2
300007  499983        2
300016  499992        2

[31579 rows x 2 columns]

In [59]:
# checking if duplicated employees have same dept or dif == DIF  /// create COMP KEY
data_emp_dep.loc[data_emp_dep["emp_no"] == 10018, :]

    emp_no dept_no
18   10018    d004
19   10018    d005

In [60]:
data_emp_dep_2 = pd.read_csv(csv3)
data_emp_dep_2.head()

  dept_no  emp_no
0    d001  110022
1    d001  110039
2    d002  110085
3    d002  110114
4    d003  110183

In [61]:
# checking if emp_no is unique
data_emp_dep_2["emp_no"].count() == data_emp_dep_2["emp_no"].nunique()

True

In [62]:
# change coolumns order to concat
data_emp_dep_2 = data_emp_dep_2.loc[:, ["emp_no","dept_no"]]
data_emp_dep_2.head()

   emp_no dept_no
0  110022    d001
1  110039    d001
2  110085    d002
3  110114    d002
4  110183    d003

In [63]:
data_emp_dep.count()

emp_no     331603
dept_no    331603
dtype: int64

In [64]:
data_emp_dep_concat = pd.concat([data_emp_dep, data_emp_dep_2])
data_emp_dep_concat

    emp_no dept_no
0    10001    d005
1    10002    d007
2    10003    d004
3    10004    d004
4    10005    d003
..     ...     ...
19  111534    d008
20  111692    d009
21  111784    d009
22  111877    d009
23  111939    d009

[331627 rows x 2 columns]

In [65]:
# generating unique PK
data_emp_dep_concat["emp_no_dept_no"] = data_emp_dep_concat["emp_no"].map(str) + "_" + data_emp_dep_concat["dept_no"]
data_emp_dep_concat

    emp_no dept_no emp_no_dept_no
0    10001    d005     10001_d005
1    10002    d007     10002_d007
2    10003    d004     10003_d004
3    10004    d004     10004_d004
4    10005    d003     10005_d003
..     ...     ...            ...
19  111534    d008    111534_d008
20  111692    d009    111692_d009
21  111784    d009    111784_d009
22  111877    d009    111877_d009
23  111939    d009    111939_d009

[331627 rows x 3 columns]

In [66]:
data_emp = pd.read_csv(csv4)
data_emp.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001   7/25/1953    Hideyuki   Zallocco   M   4/28/1990
1  475053        e0002  11/18/1954       Byong  Delgrande   F    9/7/1991
2   57444        e0002   1/30/1958       Berry       Babb   F   3/21/1992
3  421786        s0001   9/28/1957       Xiong   Verhoeff   M  11/26/1987
4  282238        e0003  10/28/1952  Abdelkader    Baumann   F   1/18/1991

In [67]:
# checking if emp_no is unique
data_emp["emp_no"].count() == data_emp["emp_no"].nunique()

True

In [68]:
data_emp_sal = pd.read_csv(csv5)
data_emp_sal.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [69]:
# checking if emp_no is unique
data_emp_sal["emp_no"].count() == data_emp_sal["emp_no"].nunique()

True

In [70]:
data_title = pd.read_csv(csv6)
data_title

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager